data_generation/simulation_results/of/case_8/constant/simParams
nIter 2000;
hComponent0 546.9126100071977;
hComponent1 918.4100440311474;
hComponent2 872.8278249302821;
hComponent3 537.6753122225255;
hComponent4 658.5570536743048;kComponent0 38.0576331965983;
kComponent1 62.35869009365438;
kComponent2 56.79043361413267;
kComponent3 43.28980598871023;
kComponent4 91.18600456104389;
tAmbient 300;
Ux 2.5247233432281795;
kPCB 0.977656007143992;